Repository: Suiram1701/SchulCloud
Catalog: SchulCloud.Web/SchulCloud.Web/Localization/Components/Pages/Auth/Verify2fa.*.resx
Languages: de

# title
source: 2FA authentication
de: 2FA-Authentifizierung

# form_AuthenticatorCode_Placeholder
source: Authentication code
de: Authentifizierungscode

# form_Persistent
source: Remember this device for 2FA authentication
de: Dieses Gerät für 2FA-Authentifizierungen merken

# signIn_LockedOut
source: The user is currently locked out. Please try again in {0}.
de: Der Benutzer ist derzeit gesperrt. Versuchen Sie es in {0} erneut.

# signIn_LockedOut_NotSpecified
source: The user is banned indefinitely.
de: Der Benutzer ist auf unbestimmte Zeit gesperrt.

# signIn_NotAllowed
source: This user is currently not allowed to log in.
de: Es ist diesem Nutzer derzeit nicht erlaubt sich anzumelden.

# desc
source: Additional protection through 2FA authentication has been activated for this account.
de: Für dieses Konto wurde der zusätzliche schutz durch 2FA-Authentifizierung aktiviert.

# desc_Authenticator
source: Enter the code generated by your 2FA authentication app to complete authentication.
de: Geben Sie den von Ihrer 2FA-Authentifizierungs-App generierten Code ein, um die Authentifizierung abzuschließen.

# signIn_Failed
source: The code entered is not valid.
de: Der eingegebene Code ist nicht gültig.

# form_RecoveryCode_Placeholder
source: Recovery code
de: Wiederherstellungscode

# desc_Recovery
source: Enter a valid user recovery code to complete the authentication. The "remain signed in" and "Remember this device" functions are not available here.
de: Geben Sie einen gültigen Wiederherstellungscodes des Benutzers ein um die Authentifizierung Abzuschließen. Die Funktionen "Angemeldet bleiben" und "Dieses Gerät merken" sind hierbei nicht verfügbar.

# method_Authenticator
source: App authentication
de: App-Authentifizierung

# method_Recovery
source: Recovery codes
de: Wiederherstellungscodes

# methods
source: Authentication methods
de: Authentifizierungsmethoden

# form_EmailCode_Placeholder
source: Confirmation code
de: Bestätigungscode

# desc_Email
source: Click "Send Code" to send a confirmation request to the account email address. Enter the received code to complete the authentication.
de: Klicken Sie auf „Code senden“, um eine Bestätigung Anfrage an die E-Mail-Adresse des Kontos zu senden. Geben Sie den erhaltenen Code ein, um die Authentifizierung abzuschließen.

# method_Email
source: Email authentication
de: E-Mail Authentifizierung

# emailConfirmation_Timeout
source: Confirmation code cannot be sent.
de: Bestätigungscode kann nicht gesendet werden.

# emailConfirmation_TimeoutMessage
source: A verification code has already been sent to this user. Please try again in {0}.
de: An diesen Benutzer wurde bereits ein Bestätigungscode gesendet. Versuchen Sie es in {0} noch einmal.

# emailConfirmation
source: Confirmation code sent
de: Bestätigungscode gesendet

# emailConfirmationMessage
source: The verification code was sent to {0}.
de: Der Bestätigungscode wurde an {0} gesendet.
