Repository: Suiram1701/SchulCloud
Catalog: SchulCloud.Web/SchulCloud.Web/Localization/Components/Pages/Account/Security/Index.*.resx
Languages: de

# title
source: Account Security
de: Konto Sicherheit

# tabHeader
source: Account Security
de: Konto Sicherheit

# tabSignIn
source: Sign in
de: Anmeldung

# signIn_Password
source: Password
de: Passwort

# signIn_Last
source: Last sign in: {0}
de: Letzte Anmeldung: {0}

# password_Desc
source: The password is used to log in to this account. To protect your account, keep your password secret and do not share it with anyone. Use a strong password to log in to your account. Your password must meet at least the following security requirements.
de: Das Passwort wird zum Anmelden an diesem Konto verwendet. Um Ihr Konto zu schützen, halten Sie Ihr Passwort geheim und geben Sie es nicht an andere weiter. Verwenden Sie ein sicheres Passwort, um sich bei Ihrem Konto anzumelden. Ihr Passwort muss mindestens folgende Sicherheitsanforderungen erfüllen.

# password_Change
source: Change Password
de: Passwort ändern

# password_Reset
source: Forgot Password?
de: Passwort vergessen?

# mfaMethods
source: 2-factor authentication (2FA)
de: 2-Faktor-Authentifizierung (2FA)

# signInMethods
source: Login methods
de: Anmeldemethoden

# mfa_Authenticator
source: Authentication app
de: Authentifizierungs-App

# authenticator_Enable
source: Enable authentication app
de: Authentifizierungs-App aktivieren

# authenticator_Desc
source: 2FA authentication using an authentication app uses an app on your mobile device to generate a temporary, one-time code each time you log in.
de: Die 2FA-Authentifizierungs mittels einer Authentifizierungs-App nutzt eine App auf Ihrem Mobilgerät, um bei jeder Anmeldung einen temporären, einmalig gültigen Code zu generieren.

# authenticator_Disable
source: Disable authentication app
de: Authentifizierungs-App deaktivieren

# authenticator_DisableMessage
source: You are about to disable 2FA authentication. This will invalidate the authenticator app codes and backup codes. Do you still want to continue?
de: Sie sind dabei die 2FA Authentifizierung zu deaktivieren. Dies sorgt dafür, dass Codes der Authenticator-App und die Backup-Codes ungültig werden. Wollen Sie trotzdem fortfahren?

# authenticator_DisableExecuteBtn
source: Deactivate
de: Deaktivieren

# mfa_Desc
source: Two-factor authentication (2FA) provides an additional layer of security for your account. Once activated, you will need an additional factor in addition to your password to log in. This method ensures that only you can access your account, even if your password is compromised.
de: Eine Zwei-Faktor Authentifizierungs (2FA) bietet eine zusätzliche Sicherheitsebene für Ihr Konto. Nach der Aktivierung benötigen Sie neben Ihrem Passwort auch einen weiteren Faktor zur Anmeldung. Diese Methode stellt sicher, dass nur Sie, selbst wenn Ihr Passwort kompromittiert ist, Zugang zu Ihrem Konto haben.

# authenticator_Disable_Success
source: 2FA authentication has been disabled
de: Die 2FA-Authentifizierung wurde deaktiviert

# authenticator_Disable_SuccessMessage
source: The additional account security provided by 2FA authentication is no longer available.
de: Die zusätzliche Kontosicherheit durch die 2FA-Authentifizierung nicht mehr verfügbar.

# recovery_Desc
source: 2FA recovery codes are a one-time code that allows you to regain access to your account if all other 2FA authentication methods are unavailable. Keep these codes safe as they are an important backup option to ensure account access.
de: 2FA-Wiederherstellungscodes sind ein einmalig gültige Codes, der es ermöglicht, den Zugang zu Ihrem Konto wiederherzustellen, falls alle anderen 2FA-Authentifizierungsmethoden nicht verfügbar ist. Bewahre diese Codes sicher auf, da er eine wichtige Backup-Option darstellt, um den Zugriff auf das Konto zu gewährleisten.

# recovery_ValidCodes
source: {0} codes are valid
de: {0} Codes sind Gültig

# recovery_GenerateNew
source: Generate recovery codes
de: Wiederherstellungscodes generieren

# recovery_Renew
source: Generate new recovery codes
de: Neue Wiederherstellungscodes generieren

# email_Enable
source: Enable email authentication
de: E-Mail Authentifizierung aktivieren

# email_Enable_Success
source: Email authentication enabled
de: E-Mail Authentifizierung aktiviert

# email_Enable_SuccessMessage
source: Email authentication can now be used as a 2FA authentication method.
de: Die E-Mail Authentifizierung kann nun als 2FA Authentifizierungs-Methode genutzt werden.

# enable_Error
source: An error occurred during activation.
de: Beim der aktivieren ist ein Fehler aufgetreten.

# email_Disable
source: Disable email authentication
de: E-Mail Authentifizierung deaktivieren

# email_Disable_Success
source: Email authentication disabled.
de: E-Mail Authentifizierung deaktiviert.

# disable_Error
source: An error occurred during deactivation.
de: Bei der deaktivierung ist ein Fehler aufgetreten.

# email_Disable_SuccessMessage
source: Email 2FA authentication is no longer available for this account.
de: Die E-Mail 2FA-Authentifizierung ist nun nicht mehr für diesen Account verfügbar.

# mfa_Email
source: Email authentication
de: E-Mail Authentifizierung

# email_Desc
source: With 2FA authentication via email, you will receive a one-time code to the email address of your account.
de: Bei der 2FA-Authentifizierung per E-Mail erhalten Sie Einmalcode an die E-Mail-Adresse ihres Accounts.

# authenticator_DisableAbortBtn
source: Cancel
de: Abrechen
